// let a = 10 
// if (a === 10){
//     console.log("верно");
// } else {
//     console.log("неверно");
// } 1

// let a = 50
// let b = 100
// if (a > b){
//     console.log("a больше b");
// } else if (a < b) {
//     console.log("a меньше b");
// } 2

// let a = "0"
// if (a > 0){
//     console.log("positive");
// } else if (a == 0){  // тут лучше использовать три равно это будет строгое сравнение, если мы используем два равно то js не сравнивает типы данных
//     console.log("равно");
// } else if (a < 0){
//     console.log("negative");
// } 3

// let number = 45 
// if (number % 2 == 0){
// console.log("Четное число");
// } else{
//     console.log("Нечетное число");
// } // 4 переменная названа как тип данных, это зарезервированное слово, тут будет лучше если его назвать num 

// let a = 10
// let b = 2 
// if (a % b == 0){
//     console.log("Четное число");
// } else{
//     console.log("Нечетное число");
// } // 5 эту задачу мы разбирали с Сымбат, нам нужно проверить на четность остаток от деления

// let s = 10
// console.log(typeof s); // вот так вот правильно

// let s = true
// if (s){
//     console.log(true);
// }else{
//     console.log(false);
// }
// console.log(typeof s); // вот этот метод неправильный

// let s = "kanykei"
// console.log(typeof s); // 6 и вот так вот правильно

// let a = 2
// if (a > 1 && a < 9){
//     console.log("верно");
// } else {
//     console.log("неверно");
// } 7

// let a = 4
// if (a == 3 || 7) {      // условие будет (a === 3 || a === 7) т.е если (а) равна трем или(||) (а) равна семи 
//     console.log(a + 7);
// } else{
//     console.log(a / 10);
// } // 8 тут если наша переменная а будет равна 4 например то а должно делиться на 10 (изза неправильного условия отрабатывает только первый консоль)

// let a = 1
// let b = 4
// if (a == 0 || a > 0 + b > 5 || b == 5){ // условие (a <= 0 && a >= 5)
//     console.log();  // то выведи a + b
// } else {
//     console.log(a - b);
// } 9

// let a = 9
// let b = 8
// if (a > 4 && a < 5){
//                                  // тут нам нужен консоль лог при котором (a > 4 && a < 5) это условие будет что то показывать
// } else if(b > b == 7 && b < 17){
//     console.log("верно");
// }else{
//     console.log("неверно");
// } 10

// let month = 8
// if (month = 3 || 4 || 5){
//     console.log("весна");
// }else if(month = 6 || 7 || 8){
//     console.log("лето");
// }else if(month = 9 || 10 || 11){
//     console.log("осень");
// }else{
//     console.log("зима");
// } 11

// let day = 12
// if (day = 1|| 2 || 3 || 4 || 5 || 6 || 7 || 8 || 9 || 10 ){
//     console.log("первая");
// }else if(day = 11|| 12 || 13 || 14 || 15 || 16 || 17 || 18 || 19 || 20 ){
//     console.log("вторая");
// }else if(day = 21|| 22 || 23 || 24 || 25 || 26 || 27 || 28 || 29 || 30 || 31){
//     console.log("третья");
// } 12

// 13. Вам дана переменная a='12345'. Проверьте, что первым символом этой переменной является цифра 1, 2 или 3. Если это так – выведите ‘да’, в противном случае выведите ‘нет’.


// Я рад что вы отправили как получилось. Теперь я примерно понимаю в чем возникают сложности. Жду вас в четверг на код ревью, по подробнее разберем. 
// Как таковых больших проблем нет, в четверг чуток обьясню про условные операторы и логические операторы. Вы проделали калосальную работу, так держать! 
// В этой домашке я увидел вашу усидчивость и настойчивость, очень хорошие навыки которым владеют не все 